[
    [
        "Title: Machine Design Engineer",
        "Company: Birch Brothers Southern, Inc.",
        "Description: \nResponsible for developing new machine design for customer manufacturing processes that prioritize safety, product quality, and maximize production.\n",
        "Salary: $30 - $40 an hour"
    ],
    [
        "Title: new10159-Associate Industrial Engineer",
        "Company: TJ Maxx",
        "Description: \nJob Summary: Designs, develops and implements process improvements, work methods, efficient layouts, transportation solutions and material handling engineering…\n",
        "Salary: Not Provided"
    ],
    [
        "Title: Performance Improvement Engineer",
        "Company: Bedgear, LLC",
        "Description: \nHOURS AVAILABLE: Monday - Friday 8:30 AM – 5:30 PM; occasional availability outside of traditional business hours may be required for meetings, special projects…\n",
        "Salary: From $70,000 a year"
    ],
    [
        "Title: Process Engineer Manufacturing",
        "Company: Arjobex America, Inc.",
        "Description: \n$68,000 to $76,000 Annually (depending on experience).\nLife, 401K, Vision, Medical, Dental.\nThis position supports Plant Manufacturing and Technical Operations…\n",
        "Salary: $68,000 - $76,000 a year"
    ],
    [
        "Title: Project Engineer",
        "Company: Composite Resources",
        "Description: \nWe offer a competitive benefits package including PTO, paid holidays, and 401K.\nQualifications: *Bachelor’s in Engineering or equivalent work experience.\n",
        "Salary: $50,000 - $90,000 a year"
    ],
    [
        "Title: Electronic Engineer or Sr. Tech for Design/Repair Lab",
        "Company: Brumley South, Inc",
        "Description: \nIf so, prepare to innovate, create, and inspire.*.\n. Ability to Redesign or offer suggestions on how to Reverse Engineer some Mechanical and Electronic items.\n",
        "Salary: $45,000 - $80,000 a year"
    ],
    [
        "Title: newOffice Engineer 1",
        "Company: M.C. Dean, Inc.",
        "Description: \nProvides technical & administrative information to others working on a project to ensure that the work complies with all basic engineering standards, codes,…\n",
        "Salary: Not Provided"
    ],
    [
        "Title: newEngineer",
        "Company: Sealed Air Corporation",
        "Description: \nAs an engineer on this team, you will have the opportunity to expand your technical knowledge as you interface with technicians, chemical engineers, scientists,…\n",
        "Salary: Not Provided"
    ],
    [
        "Title: newResearch Engineer - R&D Center",
        "Company: GITI TIRE USA LTD",
        "Description: \nSupport tire development effort through application of the developed tools and provide design engineers with recommendations for performance improvements.\n",
        "Salary: Not Provided"
    ],
    [
        "Title: Entry Level R&D Engineer",
        "Company: Medical Murray",
        "Description: \nDevelop and engineer disposable medical devices from concept to production.\nThe R&D Engineer position performs the function of the design engineer for product…\n",
        "Salary: Not Provided"
    ],
    [
        "Title: Associate Field Engineer",
        "Company: Emerson",
        "Description: \nAssist in carrying out more sophisticated engineering assignments under the direction of a more senior field engineer, we are automation consultants to the…\n",
        "Salary: Not Provided"
    ],
    [
        "Title: newApplication Engineer (Noise and Vibration)",
        "Company: Crystal Instruments Corporation",
        "Description: \nThis role requires a mechanical engineering background and expertise combined with organized, outstanding presentation and communication skills.\n",
        "Salary: $5,000 - $6,000 a month"
    ],
    [
        "Title: Energy Engineer",
        "Company: UNC Charlotte",
        "Description: \nThe Energy Engineer will support the monitoring of the energy usage and performs cost analysis; support the strategic plan for University wide-energy needs;…\n",
        "Salary: Not Provided"
    ],
    [
        "Title: Field Service Engineer / Laser",
        "Company: GE Aviation",
        "Description: \nCompetently communicate Laser machine status to engineers, customers, and management.\nResponsible for developing and maintaining strong interpersonal…\n",
        "Salary: Not Provided"
    ],
    [
        "Title: newQuality Engineer",
        "Company: DPHR",
        "Description: \nShort- and Long-term Disability benefits.\nPlans and conducts quality analysis, design of experiments, and products tests to assure the quality of TMA products.\n",
        "Salary: $75,000 - $80,000 a year"
    ]
]